Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ31048_SL3.svd
            <register>
               <name>PMD3</name>
               <addressOffset>0xe0</addressOffset>
               <fields>
                  <field>
                     <name>SER0MD</name>
                     <description>SERCOM0 Module Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SER1MD</name>
                     <description>SERCOM1 Module Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SER2MD</name>
                     <description>SERCOM2 Module Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DACMD</name>
                     <description>DAC Module Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC0MD</name>
                     <description>TC0 Module Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC1MD</name>
                     <description>TC1 Module Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC2MD</name>
                     <description>TC2 Module Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC3MD</name>
                     <description>TC3 Module Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC4MD</name>
                     <description>TC4 Module Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC5MD</name>
                     <description>TC5 Module Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC6MD</name>
                     <description>TC6 Module Disable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC7MD</name>
                     <description>TC7 Module Disable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC0MD</name>
                     <description>TCC0 Module Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC1MD</name>
                     <description>TCC1 Module Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC2MD</name>
                     <description>TCC2 Module Disable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MISCSTAT</name>
               <addressOffset>0x100</addressOffset>
               <resetValue>0x01000081</resetValue>
               <fields>
                  <field>
                     <name>CLDORDY</name>
                     <description>CLDO Ready</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CM4SWRST_EN</name>
                     <description>CM4 SW Reset Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID</name>
               <description>Device ID</description>
               <addressOffset>0x140</addressOffset>
               <access>read-only</access>
            </register>
            <register>
               <name>BCFG0</name>
               <addressOffset>0x200</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PCSCMODE</name>
                     <description>PCHE Single cache Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CP</name>
                     <description>Boot Code Protect</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIGN</name>
                     <description>Flash SIGN</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BINFOVALID0</name>
                     <description>First 256-bit BCFG information Valid</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGCON0CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x4</addressOffset>
            </register>
            <register>
               <name>CFGCON0SET</name>
               <description>Bit set register</description>
               <addressOffset>0x8</addressOffset>
            </register>
            <register>
               <name>CFGCON0INV</name>
               <description>Bit invert register</description>
               <addressOffset>0xc</addressOffset>
            </register>
            <register>
               <name>CFGCON1CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x14</addressOffset>
            </register>
            <register>
               <name>CFGCON1SET</name>
               <description>Bit set register</description>
               <addressOffset>0x18</addressOffset>
            </register>
            <register>
               <name>CFGCON1INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x1c</addressOffset>
            </register>
            <register>
               <name>CFGCON2CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x24</addressOffset>
            </register>
            <register>
               <name>CFGCON2SET</name>
               <description>Bit set register</description>
               <addressOffset>0x28</addressOffset>
            </register>
            <register>
               <name>CFGCON2INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x2c</addressOffset>
            </register>
            <register>
               <name>CFGCON4CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x44</addressOffset>
            </register>
            <register>
               <name>CFGCON4SET</name>
               <description>Bit set register</description>
               <addressOffset>0x48</addressOffset>
            </register>
            <register>
               <name>CFGCON4INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x4c</addressOffset>
            </register>
            <register>
               <name>CFGPGQOSCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x54</addressOffset>
            </register>
            <register>
               <name>CFGPGQOSSET</name>
               <description>Bit set register</description>
               <addressOffset>0x58</addressOffset>
            </register>
            <register>
               <name>CFGPGQOSINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x5c</addressOffset>
            </register>
            <register>
               <name>CFGPCLKGEN1CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x64</addressOffset>
            </register>
            <register>
               <name>CFGPCLKGEN1SET</name>
               <description>Bit set register</description>
               <addressOffset>0x68</addressOffset>
            </register>
            <register>
               <name>CFGPCLKGEN1INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x6c</addressOffset>
            </register>
            <register>
               <name>CFGPCLKGEN2CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x74</addressOffset>
            </register>
            <register>
               <name>CFGPCLKGEN2SET</name>
               <description>Bit set register</description>
               <addressOffset>0x78</addressOffset>
            </register>
            <register>
               <name>CFGPCLKGEN2INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x7c</addressOffset>
            </register>
            <register>
               <name>CFGPCLKGEN3CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x84</addressOffset>
            </register>
            <register>
               <name>CFGPCLKGEN3SET</name>
               <description>Bit set register</description>
               <addressOffset>0x88</addressOffset>
            </register>
            <register>
               <name>CFGPCLKGEN3INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x8c</addressOffset>
            </register>
            <register>
               <name>CFGPCLKGEN4CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x94</addressOffset>
            </register>
            <register>
               <name>CFGPCLKGEN4SET</name>
               <description>Bit set register</description>
               <addressOffset>0x98</addressOffset>
            </register>
            <register>
               <name>CFGPCLKGEN4INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x9c</addressOffset>
            </register>
            <register>
               <name>USER_IDCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0xa4</addressOffset>
            </register>
            <register>
               <name>USER_IDSET</name>
               <description>Bit set register</description>
               <addressOffset>0xa8</addressOffset>
            </register>
            <register>
               <name>USER_IDINV</name>
               <description>Bit invert register</description>
               <addressOffset>0xac</addressOffset>
            </register>
            <register>
               <name>PMD1CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0xc4</addressOffset>
            </register>
            <register>
               <name>PMD1SET</name>
               <description>Bit set register</description>
               <addressOffset>0xc8</addressOffset>
            </register>
            <register>
               <name>PMD1INV</name>
               <description>Bit invert register</description>
               <addressOffset>0xcc</addressOffset>
            </register>
            <register>
               <name>PMD2CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0xd4</addressOffset>
            </register>
            <register>
               <name>PMD2SET</name>
               <description>Bit set register</description>
               <addressOffset>0xd8</addressOffset>
            </register>
            <register>
               <name>PMD2INV</name>
               <description>Bit invert register</description>
               <addressOffset>0xdc</addressOffset>
            </register>
            <register>
               <name>PMD3CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0xe4</addressOffset>
            </register>
            <register>
               <name>PMD3SET</name>
               <description>Bit set register</description>
               <addressOffset>0xe8</addressOffset>
            </register>
            <register>
               <name>PMD3INV</name>
               <description>Bit invert register</description>
               <addressOffset>0xec</addressOffset>
            </register>
